In [1]:
import pandas as pd
import numpy as np

In [2]:
labels=["a","b","c"]
a=[10,20,30]
b=np.array(a)
d={"a":10,"b":40,"c":58}

In [3]:
pd.Series(index=labels,data=a)

a    10
b    20
c    30
dtype: int64

In [4]:
pd.Series(a,labels)

a    10
b    20
c    30
dtype: int64

In [5]:
d

{'a': 10, 'b': 40, 'c': 58}

In [6]:
pd.Series(d)

a    10
b    40
c    58
dtype: int64

In [7]:
def f(a,b):
    return a
f(b=2,a=4)

4

In [8]:
s1=pd.Series([1,2,3,4],["manoj","pavan","teja","arjun"])

In [9]:
s1["pavan"]

2

In [10]:
s2=pd.Series([1,2,4,5],["manoj","pavan","nani","krishna"])

In [11]:
s1+s2

arjun      NaN
krishna    NaN
manoj      2.0
nani       NaN
pavan      4.0
teja       NaN
dtype: float64

In [12]:
s3=pd.Series([1,2,3,4,5,6],list("abcdef"))
s3

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [13]:
from numpy.random import randn

In [14]:
#np.random.randn(10)#it will keep on changing when we hit the commmand again and again to control that we use an random.seed()

In [15]:
np.random.seed(103)
df=pd.DataFrame(randn(5,4),["A","B","C","D","E"],[1,2,3,"e"])
df

          1         2         3         e
A -1.249278 -0.260331  0.383793 -0.385461
B -1.085137  2.327219  0.430793  0.432316
C -0.980011 -0.631965  0.577442 -0.124758
D  0.978948  1.594922 -1.201945 -1.376369
E  1.054346 -0.038853  0.680286  1.329175

In [16]:
df[[1,"e"]]

          1         e
A -1.249278 -0.385461
B -1.085137  0.432316
C -0.980011 -0.124758
D  0.978948 -1.376369
E  1.054346  1.329175

In [17]:
df["new"]=df[1]+df[2]

In [18]:
df

          1         2         3         e       new
A -1.249278 -0.260331  0.383793 -0.385461 -1.509610
B -1.085137  2.327219  0.430793  0.432316  1.242082
C -0.980011 -0.631965  0.577442 -0.124758 -1.611977
D  0.978948  1.594922 -1.201945 -1.376369  2.573869
E  1.054346 -0.038853  0.680286  1.329175  1.015492

In [19]:
df.drop("new",axis=1,inplace=True)

In [20]:
df

          1         2         3         e
A -1.249278 -0.260331  0.383793 -0.385461
B -1.085137  2.327219  0.430793  0.432316
C -0.980011 -0.631965  0.577442 -0.124758
D  0.978948  1.594922 -1.201945 -1.376369
E  1.054346 -0.038853  0.680286  1.329175

In [22]:
df["f"]=[1,2,3,4,5]

In [23]:
df

          1         2         3         e  f
A -1.249278 -0.260331  0.383793 -0.385461  1
B -1.085137  2.327219  0.430793  0.432316  2
C -0.980011 -0.631965  0.577442 -0.124758  3
D  0.978948  1.594922 -1.201945 -1.376369  4
E  1.054346 -0.038853  0.680286  1.329175  5

In [24]:
df.drop("f",axis=1,inplace=True)

In [25]:
df

          1         2         3         e
A -1.249278 -0.260331  0.383793 -0.385461
B -1.085137  2.327219  0.430793  0.432316
C -0.980011 -0.631965  0.577442 -0.124758
D  0.978948  1.594922 -1.201945 -1.376369
E  1.054346 -0.038853  0.680286  1.329175

In [26]:
df.loc[["B"],[2]]

          2
B  2.327219

In [27]:
df

          1         2         3         e
A -1.249278 -0.260331  0.383793 -0.385461
B -1.085137  2.327219  0.430793  0.432316
C -0.980011 -0.631965  0.577442 -0.124758
D  0.978948  1.594922 -1.201945 -1.376369
E  1.054346 -0.038853  0.680286  1.329175

In [28]:
df[df[1]<0]

          1         2         3         e
A -1.249278 -0.260331  0.383793 -0.385461
B -1.085137  2.327219  0.430793  0.432316
C -0.980011 -0.631965  0.577442 -0.124758

In [29]:
df.iloc[[0],[1]]

          2
A -0.260331

In [30]:
df.reset_index()

  index         1         2         3         e
0     A -1.249278 -0.260331  0.383793 -0.385461
1     B -1.085137  2.327219  0.430793  0.432316
2     C -0.980011 -0.631965  0.577442 -0.124758
3     D  0.978948  1.594922 -1.201945 -1.376369
4     E  1.054346 -0.038853  0.680286  1.329175

In [33]:
a="king nag chai taman raj".split()
a

['king', 'nag', 'chai', 'taman', 'raj']

In [35]:
df["names"]=a
df

          1         2         3         e  names
A -1.249278 -0.260331  0.383793 -0.385461   king
B -1.085137  2.327219  0.430793  0.432316    nag
C -0.980011 -0.631965  0.577442 -0.124758   chai
D  0.978948  1.594922 -1.201945 -1.376369  taman
E  1.054346 -0.038853  0.680286  1.329175    raj

In [36]:
df.set_index("names")

              1         2         3         e
names
king  -1.249278 -0.260331  0.383793 -0.385461
nag   -1.085137  2.327219  0.430793  0.432316
chai  -0.980011 -0.631965  0.577442 -0.124758
taman  0.978948  1.594922 -1.201945 -1.376369
raj    1.054346 -0.038853  0.680286  1.329175

In [37]:
df[(df[1]<0) & (df["e"]>1)]

Empty DataFrame
Columns: [1, 2, 3, e, names]
Index: []

In [38]:
a="a b c d e f g h i".split()

In [39]:
a=[x for x in range(20)]
a

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19]

In [41]:
import numpy as np
import pandas as pd

In [42]:
outside=['G1', 'G1', 'G1', 'G2', 'G2', 'G3']
inside=[1,2,3,1,2,3]
hindex=list(zip(outside,inside))
hindex=pd.MultiIndex.from_tuples(hindex)

In [43]:
hindex

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G3', 3)],
           )

In [44]:
inside

[1, 2, 3, 1, 2, 3]

In [45]:
df=pd.DataFrame(randn(6,2),hindex,["a","b"])

In [46]:
df

             a         b
G1 1  1.283450 -1.758254
   2  0.614306  1.516358
   3 -0.195977 -0.817206
G2 1 -0.946128  0.220639
   2 -0.600734 -0.152566
G3 3 -1.187443  0.299138

In [47]:
randn(6,2)

array([[-0.94776417, -1.84338194],
       [ 0.81058919, -0.75225658],
       [-0.43646901,  0.04727664],
       [-0.25082764,  0.16708739],
       [ 0.6656462 ,  1.697165  ],
       [ 1.05368458,  0.29261982]])

In [48]:
a=["a","b","c","d"]
print(list(enumerate(a)))

[(0, 'a'), (1, 'b'), (2, 'c'), (3, 'd')]

In [49]:
df.loc["G1"].loc[1]

a    1.283450
b   -1.758254
Name: 1, dtype: float64

In [50]:
import pandas as pd
import numpy as np

In [51]:
a={
    "a":[1,2,3,4,5],
    "b":[6,7,8,6,7],
    "key":[11,22,22,44,55]
}

In [52]:
df=pd.DataFrame(a)

In [53]:
df

   a  b  key
0  1  6   11
1  2  7   22
2  3  8   22
3  4  6   44
4  5  7   55

In [54]:
df["b"].unique()

array([6, 7, 8], dtype=int64)

In [55]:
df["b"].value_counts()

6    2
7    2
8    1
Name: b, dtype: int64

In [56]:
df[(df["b"]>6) & (df["key"]>22)]

   a  b  key
4  5  7   55

In [57]:
def times2(x):
    return x*2

In [58]:
df["a"].sum()

15

In [59]:
df["a"].apply(times2)

0     2
1     4
2     6
3     8
4    10
Name: a, dtype: int64

In [60]:
df["a"].apply(lambda x:x*2)

0     2
1     4
2     6
3     8
4    10
Name: a, dtype: int64

In [61]:
df.drop("a",axis=1,inplace=True)

In [62]:
df.columns

Index(['b', 'key'], dtype='object')

In [63]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [64]:
 df

   b  key
0  6   11
1  7   22
2  8   22
3  6   44
4  7   55

In [65]:
df.sort_values(by="b")

   b  key
0  6   11
3  6   44
1  7   22
4  7   55
2  8   22

In [66]:
df.isnull()

       b    key
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False

In [67]:
data={
    "A":['fan','fan','fan','bike','bike','bike'],
    "B":['one','one','two','two','one','one'],
    "C":['x','y','x','y','x','y'],
    "D":[1,3,2,5,4,1]
}
df=pd.DataFrame(data)

In [68]:
df

      A    B  C  D
0   fan  one  x  1
1   fan  one  y  3
2   fan  two  x  2
3  bike  two  y  5
4  bike  one  x  4
5  bike  one  y  1

In [69]:
df.pivot_table(values='D',index=["A","B"],columns="C")

C           x    y
A    B
bike one  4.0  1.0
     two  NaN  5.0
fan  one  1.0  3.0
     two  2.0  NaN

In [70]:
pwd

'C:\\Users\\manoj'

In [74]:
pd.read_csv("file.csv")

     a   b   c
1    2   3  30
4    5   6  60
12  23  34  78
23  34  45  90

In [72]:
pd.read_csv(r"C:\Users\manoj\Desktop\output.csv")     #error is file is deleted in local folder

FileNotFoundError: [Errno 2] No such file or directory: 'C:\\Users\\manoj\\Desktop\\output.csv'

In [61]:
pd.read_excel(r"C:\Users\manoj\Desktop\marks32.xlsx")

    rollnumber  sgpa  marks
0   17f61a0201     5      3
1   17f61a0202     5      4
2   17f61a0203     5      6
3   17f61a0204     5      8
4   17f61a0205     3      9
5   17f61a0206     6      6
6   17f61a0207     7      4
7   17f61a0208     7      2
8   17f61a0209     7      1
9   17f61a0210     8      4
10  17f61a0211     4      7
11  17f61a0212     3      8
12  17f61a0213     2      9
13  17f61a0214     2      4

In [63]:
pd.read_html(r"C:\Users\manoj\Desktop\Temporory\pdfs or documents\trail.html")

[                        Company           Contact  Country
 0           Alfreds Futterkiste      Maria Anders  Germany
 1    Centro comercial Moctezuma   Francisco Chang   Mexico
 2                  Ernst Handel     Roland Mendel  Austria
 3                Island Trading     Helen Bennett       UK
 4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
 5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy]